spec/fixtures/files/stripe_api/successful_charge.json

{ 
  "id": "ch_1DuHGsESypPNvvdY0mPhSbW0",
  "object": "charge",
  "amount": 999,
  "amount_refunded": 0,
  "application": null,
  "application_fee": null,
  "application_fee_amount": null,
  "balance_transaction": "txn_1DuHGsESypPNvvdYdHklP0cv",
  "captured": true,
  "created": 1547894510,
  "currency": "eur",
  "customer": null,
  "description": "Example charge",
  "destination": null,
  "dispute": null,
  "failure_code": null,
  "failure_message": null,
  "fraud_details": {},
  "invoice": null,
  "livemode": false,
  "metadata": {},
  "on_behalf_of": null,
  "order": null,
  "outcome": {"network_status":"approved_by_network","reason":null,"risk_level":"normal","risk_score":28,"seller_message":"Payment complete.","type":"authorized"},
  "paid": true,
  "payment_intent": null,
  "receipt_email": null,
  "receipt_number": null,
  "receipt_url": "https://pay.stripe.com/receipts/acct_1DLYH2ESypPNvvdY/ch_1DuHGsESypPNvvdY0mPhSbW0/rcpt_EN1JyZ9MBR1adNum9ItLOxYdIubbex7",
  "refunded": false,
  "refunds": {"object":"list","data":[],"has_more":false,"total_count":0,"url":"/v1/charges/ch_1DuHGsESypPNvvdY0mPhSbW0/refunds"},
  "review": null,
  "shipping": null,
  "source": {"id":"card_1DuHGhESypPNvvdYwue44hSR","object":"card","address_city":null,"address_country":null,"address_line1":null,"address_line1_check":null,"address_line2":null,"address_state":null,"address_zip":"12111","address_zip_check":"pass","brand":"Visa","country":"US","customer":null,"cvc_check":"pass","dynamic_last4":null,"exp_month":4,"exp_year":2019,"fingerprint":"T2uFyKFk6S4ZKA7e","funding":"credit","last4":"4242","metadata":{},"name":null,"tokenization_method":null},
  "source_transfer": null,
  "statement_descriptor": null,
  "status": "succeeded",
  "transfer_data": null,
  "transfer_group": null
}